In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\martin\appdata\local\programs\python\python311\lib\site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\martin\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\martin\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in c:\users\martin\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in c:\users\martin\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3.1 -> 23.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
## debemos reiniciar el kernell, luego:
import pandas as pd

In [5]:
## Serie creada a partir de una lista
materias = pd.Series(['Matematicas', 'Historia', 'Programacion', 'Ingles']) ## Notar las mayusculas en el metodo
materias

0     Matematicas
1        Historia
2    Programacion
3          Ingles
dtype: object

In [7]:
## Serie creada a partir de un diccionario
dicc = {'Matematicas':6, 'Historia':4, 'Programacion':10, 'Ingles':9}

materias = pd.Series(dicc)
materias

Matematicas      6
Historia         4
Programacion    10
Ingles           9
dtype: int64

In [7]:
materias.size

4

In [8]:
materias.index

Index(['Matematicas', 'Historia', 'Programacion', 'Ingles'], dtype='object')

In [7]:
materias.dtype

string[python]

In [16]:
s = pd.Series([3, 2, 0, 1, 1, 3, 4 , 4, None])
s

0    3.0
1    2.0
2    0.0
3    1.0
4    1.0
5    3.0
6    4.0
7    4.0
8    NaN
dtype: float64

In [17]:
s.count() ## me devuelve la cantidad de elementos no NULOS, el Nan no lo considera

8

In [18]:
s.sum()

18.0

In [19]:
s.cumsum()

0     3.0
1     5.0
2     5.0
3     6.0
4     7.0
5    10.0
6    14.0
7    18.0
8     NaN
dtype: float64

In [21]:
s.value_counts() ## devuelve cuantas veces se repite cada elemento en la serie y me los ordena en forma ascendente

3.0    2
1.0    2
4.0    2
2.0    1
0.0    1
dtype: int64

In [25]:
s.min()

0.0

In [26]:
s.max()

4.0

In [27]:
s.mean() ## Promedio

2.25

In [ ]:
s.std() ## desvio estandar

In [28]:
s.describe() ## devuelve Cantidad de datos, Promedio, Min, Max y cuartiles

count    8.000000
mean     2.250000
std      1.488048
min      0.000000
25%      1.000000
50%      2.500000
75%      3.250000
max      4.000000
dtype: float64

In [29]:
s.isna() # Con el true me especifica cual es nulo

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
dtype: bool

In [31]:
s.isna().sum() # me suma cantidad de valores nulos

1

In [32]:
s.cumsum() #suma acumulada de cada elemento

0     3.0
1     5.0
2     5.0
3     6.0
4     7.0
5    10.0
6    14.0
7    18.0
8     NaN
dtype: float64

In [33]:
s

0    3.0
1    2.0
2    0.0
3    1.0
4    1.0
5    3.0
6    4.0
7    4.0
8    NaN
dtype: float64

Operaciones a cada uno de los elementos de la Serie

In [34]:
s1= s*2
s1

0    6.0
1    4.0
2    0.0
3    2.0
4    2.0
5    6.0
6    8.0
7    8.0
8    NaN
dtype: float64

In [37]:
s2= s+3
s2

0    6.0
1    5.0
2    3.0
3    4.0
4    4.0
5    6.0
6    7.0
7    7.0
8    NaN
dtype: float64

In [38]:
s3 = s.apply(lambda x: x+3) # Hacemos lo mismo pero con una funcion lambda, pero lo interesante viene despues...
s3

0    6.0
1    5.0
2    3.0
3    4.0
4    4.0
5    6.0
6    7.0
7    7.0
8    NaN
dtype: float64

In [40]:
## ponemos condiciones para que se de esa funcion lambda
s4 = s.apply(lambda x: x+3 if x>2 else x)
s4

0    6.0
1    2.0
2    0.0
3    1.0
4    1.0
5    6.0
6    7.0
7    7.0
8    NaN
dtype: float64

In [41]:
### Se usara muchisimo
s[s>2] ## devuelve los valores mayores que 2 con su index correspondiente

0    3.0
5    3.0
6    4.0
7    4.0
dtype: float64

In [42]:
s>1

0     True
1     True
2    False
3    False
4    False
5     True
6     True
7     True
8    False
dtype: bool

In [44]:
s.shape ## me da el tamaño de mi serie

(9,)

In [45]:
s.sort_values(ascending=False) # mayor a menor

6    4.0
7    4.0
0    3.0
5    3.0
1    2.0
3    1.0
4    1.0
2    0.0
8    NaN
dtype: float64

In [47]:
b = s.sort_values(ascending=False)
b

6    4.0
7    4.0
0    3.0
5    3.0
1    2.0
3    1.0
4    1.0
2    0.0
8    NaN
dtype: float64

In [48]:
b.sort_index() # ordenar segun los index

0    3.0
1    2.0
2    0.0
3    1.0
4    1.0
5    3.0
6    4.0
7    4.0
8    NaN
dtype: float64

In [ ]:
b.sort_index(ascending=False, inplace=True) # el inplace me guarda los valores en la serie, me la actualiza

In [49]:
b.dropna(inplace=True) # el inplace me guarda los valores en la serie, me la actualiza

In [50]:
data_dict = {
    'Manzanas':[3,4,5,6,7,7,5,3,6,6],
    'Naranjas':[1,3,3,3,4,5,6,7,8,8]
}
data_dict

{'Manzanas': [3, 4, 5, 6, 7, 7, 5, 3, 6, 6],
 'Naranjas': [1, 3, 3, 3, 4, 5, 6, 7, 8, 8]}

In [53]:
df = pd.DataFrame(data_dict)
df

   Manzanas  Naranjas
0         3         1
1         4         3
2         5         3
3         6         3
4         7         4
5         7         5
6         5         6
7         3         7
8         6         8
9         6         8

In [54]:
ventas_df = df
ventas_df

   Manzanas  Naranjas
0         3         1
1         4         3
2         5         3
3         6         3
4         7         4
5         7         5
6         5         6
7         3         7
8         6         8
9         6         8

In [55]:
## a oartir de lista de diccionarios
df = pd.DataFrame([{'Nombre':'Maria','Edad':18},{'Nombre':'Luis','Edad':18},{'Nombre':'Carmen','Edad':20}])
df

   Nombre  Edad
0   Maria    18
1    Luis    18
2  Carmen    20

In [56]:
## a partir de un diccionario
dicc ={
    'Nombre':['Maria','Luis','Carmen'],
    'Edad': [18,22,20]
}
df = pd.DataFrame(dicc)
df

   Nombre  Edad
0   Maria    18
1    Luis    22
2  Carmen    20

In [58]:
import numpy as np

array = np.random.randn(4,3) # 4 filas x 3 columnas
array

array([[ 1.151791  ,  1.29215999,  0.3003834 ],
       [-0.02284266,  0.15521335, -1.67994794],
       [-1.06406796, -0.17225369,  0.24611306],
       [ 0.77797921,  0.55719591, -0.42070903]])

In [59]:
df1 = pd.DataFrame(array, columns=['a','b','c']) #pongo nombre a mis columnas
df1

          a         b         c
0  1.151791  1.292160  0.300383
1 -0.022843  0.155213 -1.679948
2 -1.064068 -0.172254  0.246113
3  0.777979  0.557196 -0.420709

In [63]:
colesterol_df = pd.read_csv('colesterol.csv',sep=';',decimal=',') #los decimales de nuestro csv tienen ',', pandas reemplazara ',' por '.'
colesterol_df

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [65]:
colesterol_df.head(2) ## Primeras dos filas

                         nombre  edad sexo  peso  altura  colesterol
0  José Luis Martínez Izquierdo    18    H  85.0    1.79       182.0
1                Rosa Díaz Díaz    32    M  65.0    1.73       232.0

In [66]:
colesterol_df.tail(2) ## Ultimas dos filas

                             nombre  edad sexo   peso  altura  colesterol
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [67]:
colesterol_df.info() 
# Informacion de mis variables

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   nombre      14 non-null     object
 1   edad        14 non-null     int64
 2   sexo        14 non-null     object
 3   peso        13 non-null     float64
 4   altura      14 non-null     float64
 5   colesterol  13 non-null     float64
dtypes: float64(3), int64(1), object(2)
memory usage: 800.0+ bytes

In [68]:
colesterol_df.describe()

            edad        peso     altura  colesterol
count  14.000000   13.000000  14.000000   13.000000
mean   38.214286   70.923077   1.768571  220.230769
std    15.621379   16.126901   0.115016   39.847948
min    18.000000   51.000000   1.580000  148.000000
25%    24.750000   61.000000   1.705000  194.000000
50%    35.000000   65.000000   1.755000  210.000000
75%    49.750000   78.000000   1.840000  249.000000
max    68.000000  109.000000   1.980000  280.000000

In [69]:
colesterol_df.corr()

C:\Users\Martin\AppData\Local\Temp\ipykernel_4636\4147917001.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  colesterol_df.corr()

                edad      peso    altura  colesterol
edad        1.000000 -0.276185 -0.181774    0.452391
peso       -0.276185  1.000000  0.918984   -0.003621
altura     -0.181774  0.918984  1.000000    0.122694
colesterol  0.452391 -0.003621  0.122694    1.000000